SkyDrive/NLP/interfaces/Source Code/SOAP request.XML

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rpc="rpclib.examples.hello.soap">
   <soapenv:Header/>
   <soapenv:Body>
      <rpc:opinionAssesmentRequest>
         <!--Optional:-->
         <rpc:AO_sDocument>No fat cat sat on teh mat</rpc:AO_sDocument>
      </rpc:opinionAssesmentRequest>
   </soapenv:Body>
</soapenv:Envelope>